# -*- coding: utf-8 -*-
import xml.etree.ElementTree as ET
from nltk.tokenize import word_tokenize,sent_tokenize
import re as regex


path='.\Dataset1\Documents\Document_1.txt'

input_file = open(path,'r', encoding='utf-8')
str=input_file.read()
#print(str)

#----------Stop_words reads-------------------

bn_stw = open('./stop_words.txt','r', encoding='utf-8')
stop_words = "".join(bn_stw.readlines())
stop_words = set(stop_words.split())
#print(stop_words)



trees = ET.parse('word_modified.xml')
roots = trees.getroot()

#str = 'অনেক দিন সেঞ্চুরির দেখা পাচ্ছিলেন না রকিবুল হাসান। পরশু ঘুচেছে সেই আক্ষেপ। ওয়ালটন মধ্যাঞ্চলের ব্যাটসম্যান কাল পেয়ে গেলেন তাঁর প্রথম শ্রেণির ক্যারিয়ারে দ্বিতীয় ডাবল সেঞ্চুরিও। কক্সবাজারের শেখ কামাল আন্তর্জাতিক স্টেডিয়ামে কাল সেঞ্চুরি পেয়েছেন রকিবুল-সতীর্থ তানভীর হায়দারও। তাঁদের দল মধ্যাঞ্চলও ৮ উইকেটে ৫৮৮ রানের পাহাড় গড়ে ঘোষণা করেছে ইনিংস। জবাবে দ্বিতীয় দিন শেষে ২ উইকেটে ১৪২ করেছে ইসলামী ব্যাংক মধ্যাঞ্চল। ফ্র্যাঞ্চাইজি বাংলাদেশ ক্রিকেট লিগের (বিসিএল) চতুর্থ রাউন্ডের অন্য ম্যাচে বিসিবি উত্তরাঞ্চলকে ২৯৬ রানে অলআউট করার পর ৪ উইকেটেই ২৪৭ রান তুলে ফেলেছে প্রাইম ব্যাংক দক্ষিণাঞ্চল। কক্সবাজারের একাডেমি মাঠে ৮ উইকেটে ২৬৬ রান নিয়ে দিন শুরু করা উত্তরাঞ্চল অলআউট আরও ৩০ রান যোগ করে। জবাবে এনামুল হক ও শাহরিয়ার নাফীস উদ্বোধনী জুটিতে ১১৮ রান এনে দেন দক্ষিণাঞ্চলকে। ৭০ রান করেছেন এনামুল, শাহরিয়ার ফিরেছেন ৫২ রানে। দিন শেষে ৬০ রানে অপরাজিত ৮ হাজার রানের মাইলফলক ছোঁয়া তুষার ইমরান। ঢাকা-চট্টগ্রাম মহাসড়কের ওপর মঞ্চ বানিয়ে গতকাল বুধবার সকালে সভা করেছে নারায়ণগঞ্জের সোনারগাঁ উপজেলা যুবলীগ। এর ফলে গুরুত্বপূর্ণ মহাসড়কটিতে ১২ কিলোমিটারজুড়ে যানবাহনের সারি তৈরি হয়। প্রায় দুই ঘণ্টা যানজটের দুর্ভোগ পোহান শত শত গাড়ির যাত্রী ও চালকেরা। উপজেলা যুবলীগের নেতাদের সঙ্গে কথা বলে জানা গেছে, কেন্দ্রীয় যুবলীগের সভাপতি ওমর ফারুক চৌধুরীর নেতৃত্বে সংগঠনটির কয়েকজন কেন্দ্রীয় নেতা গতকাল ফেনী জেলা যুবলীগের সম্মেলনে যোগ দিতে যান। এ উপলক্ষে আগের দিন মঙ্গলবার বিকেলে সোনারগাঁ উপজেলা যুবলীগ ঢাকা-চট্টগ্রাম মহাসড়কের পূর্ব পাশের লেনে মঞ্চ তৈরি করে। স্থানীয় লোকজন বলেন, মঙ্গলবার রাত থেকেই মহাসড়কে যান চলাচলের ওপর এর প্রভাব পড়তে শুরু করে। গতকাল সকাল সাড়ে সাতটায় মঞ্চের সামনে মহাসড়কের ওপর নেতা-কর্মীদের বসার জন্য ১ হাজার ২০০ চেয়ার বসানো হয়। সকাল আটটা থেকে উপজেলা আওয়ামী লীগ, যুবলীগ ও ছাত্রলীগের নেতা-কর্মীরা মহাসড়কের ওপর দিয়ে মিছিল নিয়ে মঞ্চের সামনে এসে জড়ো হন। এ সময় সবগুলো লেনেই যানবাহনের চলাচল ব্যাহত হতে থাকে।১৯ ওভার শেষে বাংলাদেশের দরকার ৩ রান। টিভি সেট, রেডিও কিংবা মাঠে বসে যারা মাহমুদুল্লাহ আর মাশরাফির কথোপকথন যারা দেখছিলেন সবাই নিশ্চিত ছিলেন যে, এবার হবে। ৬ মার্চ ভারতের সঙ্গে ফাইনাল খেলবে সাকিব-তামিমরা। ২০ ওভারের প্রথম বলটি আনোয়ার আলী করতেই সেটি মাঠের বাইরে পাঠালেন মাহমুদুল্লাহ। বাংলাদেশ চলে গেল দ্বিতীয়বারের মতো এশিয়া কাপের ফাইনালে। এ জয়ের ফল ভারত-পাকিস্তানসহ কয়েকটি আন্তর্জাতিক গণমাধ্যমে প্রচার করা হয়েছে। এগুলোর মধ্যে পাকিস্তানের একটি গণমাধ্যমের শিরোনাম ছিল, পাকিস্তানের স্বপ্ন ভেঙে চুরমার করে দিল টাইগাররা। পাকিস্তানকে বেঁধে ফেলা গেছে ১২৯ রানে। বাংলাদেশ ও ৬ মার্চে এশিয়া কাপ ফাইনালের মধ্যেকার দূরত্বটা ছিল ১৩০ রানের। সৌম্য সরকারের ৪৮ রানে ভর করে সেই ফাইনালে পৌঁছে যায় বাংলাদেশ। তবে সাকিব, মাশরাফি, মাহমুদুল্লাহর অবদানও কিন্তু কম নয়। ব্যাটিং ও বোলিংয়ের মিলিত প্রয়াসে ফাইনালে পৌঁছায় বাংলাদেশ। ১৯ ওভারে ১ বলে ৫ উইকেটে ১৩১ রান তোলে মাশরাফিরা। এ জয়ের পর পাকিস্তানের এক্সপ্রেস ট্রিবিউন-এর খবরে বলা হয়েছে, পাকিস্তানকে হারিয়ে ভারতের সঙ্গে এশিয়া কাপের ফাইনালে বাংলাদেশ। দ্যা ডন-এর খবরে বাংলাদেশের জয়ের কথা বলা হয়েছে। তবে দেশটির জিও টিভি নিউজের খবরের শিরোনামটি একটু আলাদা। জিও-এর খবরে বলা হয়েছে, পাকিস্তানের স্বপ্ন ভেঙে চুরমার করে দিয়ে টাইগাররা ৫ উইকেটে জয়ী। ৬ মার্চে ভারতের সঙ্গে ফাইনাল খেলবে বাংলাদেশ।ওয়াকার ইউনিসের সংবাদ সম্মেলনে এসে চুপ করে একটা চেয়ারে বসে পড়লেন ডিন জোন্স। ধারাভাষ্য দেওয়ার পাশাপাশি কলাম-টলামও লেখেন। ভেবেছিলাম, সেটির রসদ জোগাড় করতেই সাংবাদিকের ভূমিকায়। ভুল ভাঙল কথা বলতে গিয়ে। ডিন জোন্স সংবাদ সম্মেলনে এসেছেন মাশরাফি বিন মুর্তজার কথা শুনবেন বলে। তাঁর ম্যান অব দ্য ম্যাচ যে বাংলাদেশ-অধিনায়কই!কারণ, নিশ্চয়ই বোলিং নয়। ৪ ওভারে ২৯ রান দিয়ে মাত্র ১টি উইকেট। সাকিব আল হাসান ছাড়া বাংলাদেশের বাকি সব বোলারের পারফরম্যান্সই তাঁর চেয়ে ভালো। তাহলে কি শেষে নেমে ৭ বলে ১২ রানের ইনিংসের জন্য? মোহাম্মদ আমিরের বলে সাকিবের স্টাম্পে লাল বাতি জ্বলে যাওয়াটা শুধু বোল্ডই নয়, বিপৎসংকেতও বোঝাচ্ছিল। জিততে হলে ১৬ বলে চাই ২৬ রান। বাংলাদেশের স্বপ্নেরও কি তাহলে লাল বাতি জ্বলে গেল?তা বিপদতাড়ানিয়া হয়ে মাশরাফি আছেন না! নেমেই আমিরের বলে পরপর দুটি চার। ম্যাচটার রং বদলে ‘লাল’ থেকে ‘সবুজ’ হয়ে গেল মুহূর্তেই। সেটিই কি এমন মনে ধরল ‘ডিনো’ নামে পরিচিত সাবেক অস্ট্রেলীয় ব্যাটসম্যানের? নিজের সময়ে ওয়ানডে ক্রিকেটের সেরা দু-তিনজন ব্যাটসম্যানের মধ্যে অবধারিত ছিল তাঁর নাম। বিশ্বকাপ জিতেছেন। রানিং বিটুইন দ্য উইকেটকে দিয়েছেন নতুন মাত্রা। সেই ডিন জোন্স বাংলাদেশকে নিয়ে রীতিমতো মুগ্ধতায় আচ্ছন্ন। এতটাই যে, বাংলাদেশের ফাইনালে ওঠাটা তাঁর কাছে একদমই বিস্ময় বলে মনে হচ্ছে না।চোট কাটিয়ে ফেরার পর থেকে সময়টা খুব একটা ভালো যাচ্ছে না। ফর্মের সঙ্গে যুঝছেন অ্যালেক্সিস সানচেজ। তবে মাঠের বাইরে সময়টা উপভোগই করছেন আর্সেনালের চিলিয়ান ফরোয়ার্ড। অন্তত চিলির কুকুরের খাবার প্রস্তুতকারী এক প্রতিষ্ঠানের বিজ্ঞাপন দেখে তা-ই মনে হচ্ছে। এমনিতে কুকুর ভালোবাসেন তিনি। এর আগে বড়দিনের সময়ও নিজের কুকুরদের সঙ্গে একটি ভিডিও টুইটারে দিয়েছিলেন। এবার মাস্টার ডগ নামের পণ্যের বিজ্ঞাপনে সেটি আরেকবার দেখা গেল। টুইটারে বিজ্ঞাপনটি নিজেই ছড়িয়ে দিয়েছেন। শ্যুটিং হয়েছে লন্ডনে চিলিয়ান ফরোয়ার্ডের বাড়িতে। বিজ্ঞাপনটিতে নিজের দুই ল্যাবরাডার কুকুর অ্যাটম ও হাম্বারকে পরিচয় করিয়ে দেওয়ার পর সানচেজ নিজেকে পরিচয় করিয়ে দিয়েছেন ‘মাস্টার’ নামে। সানচেজকে সকালবেলা ঘুম থেকে উঠিয়ে দিয়েছে কুকুর দুটি। আবার অ্যাটম ও হাম্বারের চোখে সানগ্লাস লাগিয়ে সেলফিও তুলেছেন আর্সেনাল তারকা। পরে বিজ্ঞাপন যে উদ্দেশ্যে, সেটি মেনে কুকুর দুটিকে খাবারও তৈরি করে দিয়েছেন সানচেজ।কানাঘুষা শোনা যাচ্ছিল, অভিযুক্ত ফুটবলারদের হয়তো শাস্তি হবে না। তবে শেষ পর্যন্ত ফুটবলাররা বাফুফের শাস্তি থেকে রেহাই পেলেন না। সাত ফুটবলারের চারজনকে পেতে হয়েছে শাস্তি। সর্বশেষ জাতীয় দলের অধিনায়ক মামুনুল ইসলাম ও উইঙ্গার জাহিদ হোসেন জাতীয় দলে নিষিদ্ধ এক বছর। মিডফিল্ডার সোহেল রানা ও স্টপার ইয়াছিন খান জাতীয় দলে নিষিদ্ধ হয়েছেন ছয় মাসের জন্য। গোলরক্ষক সোহেল, ডিফেন্ডার আতিকুর রহমান মিশু ও ইয়ামিন মুন্নাকে সতর্ক করে ছেড়ে দেওয়া হয়েছে। ফুটবলারদের আপিল করার সুযোগ নেই। কাল জাতীয় দল কমিটির সভায় গৃহীত এই সিদ্ধান্ত তাৎক্ষণিকভাবেই কার্যকর করা হয়েছে। শৃঙ্খলা ভঙ্গ, মদ্যপান, অসদাচরণ, বাফুফের আচরণবিধি লঙ্ঘন, জাতীয় দলের প্রতি নিবেদনের অভাব—মোটা দাগে এগুলোই শাস্তি পাওয়া ফুটবলারদের বিরুদ্ধে অভিযোগ। মুস্তাফিজুর রহমানের এশিয়া কাপ শেষ হয়ে গেল আকস্মিক চোটের হানায়। আসন্ন টি-টোয়েন্টি বিশ্বকাপের শুরুর দিকে তাঁর খেলা নিয়েও তৈরি হয়েছে অনিশ্চয়তা। এমন দুঃসংবাদের মধ্যে মুস্তাফিজুর রহমান পেলেন একটি সুসংবাদ, সুযোগ পেয়েছেন ইংল্যান্ডের কাউন্টি দলে খেলার। আগামী মে মাসে শুরু ন্যাটওয়েস্ট টি-টোয়েন্টি ব্লাস্ট টুর্নামেন্টে সাসেক্স তাদের দলে টেনেছে বাংলাদেশের এই বাঁহাতি পেসারকে। সাসেক্সের ওয়েবসাইটই কাল খবরটি নিশ্চিত করেছে। গত জানুয়ারি-ফেব্রুয়ারিতে মুস্তাফিজ পাকিস্তান সুপার লিগে (পিএসএল) নাম লিখিয়েও খেলতে পারেননি চোটের কারণে। সামনে ইন্ডিয়ান প্রিমিয়ার লিগে (আইপিএল) ও ইংলিশ কাউন্টির টি-টোয়েন্টি টুর্নামেন্টটিতে খেলতে পারবেন কি না শঙ্কা আছে তা নিয়েও। ইংল্যান্ডের প্রাচীনতম কাউন্টি দল সাসেক্সে কিংবা আইপিএলের দল সানরাইজার্স হায়দরাবাদে মুস্তাফিজের খেলার সুযোগ পাওয়াটা দেশের জন্যই গর্বের ব্যাপার। তবে ওই দুটি টুর্নামেন্টে তাঁর খেলার প্রধান শর্ত, ফিট থাকতে হবে শতভাগ। বিসিবি চায় না বাংলাদেশের এই পেস বোলিং প্রতিভা ওখানে খেলে চোটের ঝুঁকিতে পড়ুন। বিসিবির ক্রিকেট পরিচালনা কমিটির প্রধান আকরাম খান বললেন, \"এখানে ফিটনেসের ব্যাপারটা খুবই গুরুত্বপূর্ণ। মুস্তাফিজ ফিট থাকলে অবশ্যই সেখানে খেলবে। কাউন্টি ক্রিকেটে খেলার সুযোগ পাওয়া নিঃসন্দেহে বড় ব্যাপার। শুধু খেলা নয়, খেলার বাইরেও একজন ক্রিকেটার অনেক কিছুই শিখতে পারে কাউন্টি থেকে। ভিন্ন কন্ডিশন, ভিন্ন উইকেটে সেখানে খেলতে হয়। মুস্তাফিজ যদি ফিট থাকে, অবশ্যই খেলবে।'

#sent = []

#----------regex patterns--------------

pattern_1=r'[,|(|)|-|—|!|"|`|\?|\\|:]+'
pattern_2=r'[।]+'
pattern_3=r'[\.]'

#----------removing the special charecters-------

str=regex.sub(pattern_1,' ',str)
str=regex.sub(pattern_2,'.',str)

sent=sent_tokenize(str)
#print(sent)

#-------removing the dot (.) character---------

str=regex.sub(pattern_3,' ',str)
#print(str)


word = word_tokenize(str)
#print(word)

#----------- Stop words removing ---------------

word_tokens = [w for w in word if w not in stop_words]
print(word_tokens)

#---------------1st method for POS---------------------------------------------


item=None
dic = {}
for i in word_tokens:
    item=None
    for pos in roots.iter(i):
        item=pos.text
    if item is None:
        dic[i]='noun'
    else:
        dic[i]=item
print(dic)



#---------------2nd method for POS---------------------------------------------


# =============================================================================
# item=None
# dic = {}
# for i in word:
#     item=None
#     for WORD in roots:
#         for pOS in WORD.iter(i[0]):
#             for POS in pOS.iter(i):
#                 item=POS.text
#             if item is None:
#                 dic[i]='noun'
#             else:
#                 dic[i]=item
# print(dic)
# =============================================================================


#-------------- TF_IDF calculation----------------------------------



# =============================================================================
# tfidf = TfidfVectorizer(min_df=2,max_df=0.5,ngram_range=(1,10))
# features = tfidf.fit_transform(sent)
# x=pd.DataFrame(features.todense(),
#              columns=tfidf.get_feature_names()
#              )
# 
# #print(x)
# print(tfidf.get_feature_names())
# print(features.todense())
# 
# =============================================================================